import pandas as pd
import csv

columns = ['Хозяева', 'Гости', 'Голы хозяев', 'Голы гостей',
           'Владение мячом хозяев', 'Владение мячом гостей',
           'Удары по воротам хозяев', 'Удары по воротам гостей',
           'Удары в створ хозяев', 'Удары в створ гостей',
           'Удары мимо хозяев', 'Удары мимо гостей',
           'Заблокированные удары хозяев', 'Заблокированные удары гостей',
           'Сэйвы хозяев', 'Сэйвы гостей',
           'Фолы хозяев', 'Фолы гостей',
           'Угловые удары хозяев', 'Угловые удары гостей',
           'Штрафные удары хозяев', 'Штрафные удары гостей',
           'Вне игры хозяев',  'Вне игры гостей',
           'Удары от ворот хозяев', 'Удары от ворот гостей',
           'Автоголы хозяев', 'Автоголы гостей',
           'Забитые пенальти хозяев', 'Забитые пенальти гостей',
           'Незабитые пенальти хозяев', 'Незабитые пенальти гостей',
           'Вбрасывания хозяев', 'Вбрасывания гостей']



class SportsRu_recorder:
    def __init__(self, filename):
        self.filename = filename
        with open(filename, "w", newline="") as f:
            writer = csv.DictWriter(f, fieldnames=columns)
            writer.writeheader()

    def write_row(self, row):
        with open(self.filename, 'a') as f:
            writer = csv.writer(f)
            writer.writerow(row)

    def write_rows(self, rows):
        for row in rows:
            self.write_row(row)





