from .SportsRu_parser import SportsRu_parser
import pandas as pd

columns = ['Хозяева', 'Гости', 'Голы хозяев', 'Голы гостей',
           'Владение мячом хозяев', 'Владение мячом гостей',
           'Удары по воротам хозяев', 'Удары по воротам гостей',
           'Удары в створ хозяев', 'Удары в створ гостей',
           'Удары мимо хозяев', 'Удары мимо гостей',
           'Заблокированные удары хозяев', 'Заблокированные удары гостей',
           'Сэйвы хозяев', 'Сэйвы гостей',
           'Фолы хозяев', 'Фолы гостей'
           'Угловые удары хозяев', 'Угловые удары гостей'
           'Штрафные удары хозяев', 'Штрафные удары гостей'
           'Вне игры хозяев',  'Вне игры гостей'
           'Удары от ворот хозяев', 'Удары от ворот гостей'
           'Автоголы хозяев', 'Автоголы гостей'
           'Забитые пенальти хозяев', 'Забитые пенальти гостей',
           'Незабитые пенальти хозяев', 'Незабитые пенальти гостей',
           'Вбрасывания хозяев', 'Вбрасывания гостей']



class SportsRu_recorder:
    def __init__(self):
        ...

    def convert_to_dataframe(self, row):
        ans = pd.DataFrame([row], columns=columns)
        return ans



